# COMBINING & EXPORTING DATA

### This script contains the following:
#### 1. Importing  libraries
#### 2. Creating a path
#### 3. Import the orders product combined dataframe
#### 4. Shape
#### 5. Combining dataframes
#### 6. Merge flag
#### 7. Exporting dataframes

# ---------------------------------------------------------------------------------------------------------------

### 1. Importing the libraries

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

### 2. Creating a path

In [2]:
# We create a path to add a shortcut to our files location
path = r'C:\Users\javis\OneDrive\Documentos\Career Foundry\Data Immersion\Python\Instacart Basket Analysis'

### 3. Import the orders product combined dataframe

In [3]:
# We then give Python the instruction of reading the file located in that path
df_ords_prods_comb = pd.read_pickle(os.path.join(path, '2. Data', '2.2. Prepared Data', 'orders_products_combined.pkl'))

In [18]:
# We will also import the products file
df_prods_check = pd.read_csv(os.path.join(path, '2. Data', '2.2. Prepared Data', 'products_checked.csv'), index_col = False)

### 4. Check the shape

In [10]:
# We check the dimensions of our newly imported dataframe
df_ords_prods_comb.shape

(32434489, 11)

In [12]:
# Check the appearance
df_ords_prods_comb.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_from_last_order,first_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,both
1,2539329,1,1,2,8,NaN,True,14084,2,0,both
2,2539329,1,1,2,8,NaN,True,12427,3,0,both
3,2539329,1,1,2,8,NaN,True,26088,4,0,both
4,2539329,1,1,2,8,NaN,True,26405,5,0,both

In [19]:
# We also check the products file
df_prods_check.shape

(49672, 6)

In [20]:
df_prods_check.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [21]:
# Get rid of the first column, not representing anything
df_prods_check = df_prods_check.drop (columns = ['Unnamed: 0'])

In [22]:
df_prods_check.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

### 5. Determine a suitable way to combine them

In [26]:
# In this scenario, we would want to keep all the information in both dataframes
df_ords_prods_merged = df_ords_prods_comb.merge(df_prods_check, on = 'product_id')

In [27]:
# We check the output
df_ords_prods_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_from_last_order,first_order,product_id,add_to_cart_order,reordered,_merge,product_name,aisle_id,department_id,prices
0,2539329,1,1,2,8,NaN,True,196,1,0,both,Soda,77,7,9.0
1,2398795,1,2,3,7,15.0,False,196,1,1,both,Soda,77,7,9.0
2,473747,1,3,3,12,21.0,False,196,1,1,both,Soda,77,7,9.0
3,2254736,1,4,4,7,29.0,False,196,1,1,both,Soda,77,7,9.0
4,431534,1,5,4,15,28.0,False,196,1,1,both,Soda,77,7,9.0

### 6. Confirm the results with the merge flag

In [28]:
# We use the value counts to see the merge results
df_ords_prods_merged['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

### 7. Export the newly created dataframe

In [29]:
# Export data to pkl

df_ords_prods_merged.to_pickle(os.path.join(path, '2. Data','2.2. Prepared Data', 'orders_products_merged.pkl'))